UAV_Propeller/Multicase_Optimization/Hover/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (5 0 0);

boundaryField
{
    "(blade|spinner)"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    "(inlet|outlet|outer|inout)"
    {
        type            pressureInletOutletVelocity;
        value           uniform (5 0 0);
    }
    "cyc.*"
    {
        type            cyclic;
    }
}


// ************************************************************************* //
