UAV_Propeller/Multicase_Optimization/Hover/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];


internalField   uniform 101325;

boundaryField
{
    "(blade|spinner)"
    {
        type            zeroGradient;
    }
    "(inlet|outlet|outer|inout)"
    {
        type            totalPressure;
	p0              $internalField;
        value           $internalField;
    }
    "cyc.*"
    {
        type            cyclic;
    }
}


// ************************************************************************* //
